app/controllers/articles_controller.rb

  def destroy
    @article = Article.find(params[:id])
    Article.delete(@article)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "articles" WHERE "articles"."id" = 5

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "articles" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "baby_sloth_01.jpg"], ["image_file_size", 4514], ["image_updated_at", "2015-03-09 20:49:58.681509"], ["updated_at", "2015-03-09 20:49:58.697546"], ["id", 1]]